avr-rust/avrd/packs/xmegad/ATxmega64D4.atdf
<?xml version="1.0" encoding="UTF-8"?>
<avr-tools-device-file
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:NumHelper="NumHelper"
  xmlns:xalan="http://xml.apache.org/xalan" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd" schema-version="0.3">
  <variants>
    <variant ordercode="ATxmega64D4-AU" package="TQFP44" pinout="QFN_QFP_44" speedmax="32000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    <variant ordercode="ATxmega64D4-MH" package="VQFN44" pinout="QFN_QFP_44" speedmax="32000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    <variant ordercode="ATxmega64D4-CU" package="VFBGA49" pinout="BGA_49" speedmax="32000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    <variant ordercode="ATxmega64D4-AN" package="TQFP44" pinout="QFN_QFP_44" speedmax="32000000" tempmax="105" tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    <variant ordercode="ATxmega64D4-M7" package="VFBGA49" pinout="BGA_49" speedmax="32000000" tempmax="105" tempmin="-40" vccmax="3.6" vccmin="1.6"/>
  </variants>
  <devices>
    <device name="ATxmega64D4" architecture="AVR8_XMEGA" family="AVR XMEGA">
      <address-spaces>
        <address-space name="prog" id="prog" start="0x00000" size="0x11000" endianness="little">
          <memory-segment start="0x00000" size="0x10000" type="flash" rw="RW" exec="1" name="APP_SECTION" pagesize="256"/>
          <memory-segment start="0x0F000" size="0x1000" type="flash" rw="RW" exec="1" name="APPTABLE_SECTION" pagesize="256"/>
          <memory-segment start="0x10000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION" pagesize="256"/>
        </address-space>
        <address-space name="data" id="data" start="0x0000" size="0x3000" endianness="little">
          <memory-segment start="0x0000" size="0x1000" type="io" rw="RW" exec="0" name="IO"/>
          <memory-segment start="0x1000" size="0x0800" type="eeprom" rw="RW" exec="0" name="MAPPED_EEPROM"/>
          <memory-segment start="0x2000" size="0x1000" type="ram" rw="RW" exec="0" name="INTERNAL_SRAM"/>
        </address-space>
        <address-space name="eeprom" id="eeprom" start="0x00000" size="0x0800">
          <memory-segment start="0x00000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="32"/>
        </address-space>
        <address-space name="signatures" id="signatures" start="0x0000" size="0x0003">
          <memory-segment start="0x0000" size="0x0003" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space name="fuses" id="fuses" start="0x0000" size="0x0006">
          <memory-segment start="0x0000" size="0x0006" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space name="lockbits" id="lockbits" start="0x0000" size="0x0001">
          <memory-segment start="0x0000" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space name="user_signatures" id="user_signatures" start="0x0000" size="0x0100">
          <memory-segment start="0x0000" size="0x0100" type="user_signatures" rw="RW" exec="0" name="USER_SIGNATURES" pagesize="256"/>
        </address-space>
        <address-space name="prod_signatures" id="prod_signatures" start="0x0000" size="0x0040">
          <memory-segment start="0x0000" size="0x0040" type="other" rw="R" exec="0" name="PROD_SIGNATURES" pagesize="256"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="GPIO" id="I6085" version="XMEGAD">
          <instance name="GPIO">
            <register-group address-space="data" offset="0x0000" name-in-module="GPIO" name="GPIO"/>
          </instance>
        </module>
        <module name="VPORT" id="I6075" version="XMEGAAU">
          <instance name="VPORT0">
            <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
          </instance>
          <instance name="VPORT1">
            <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
          </instance>
          <instance name="VPORT2">
            <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
          </instance>
          <instance name="VPORT3">
            <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
          </instance>
        </module>
        <module name="XOCD" id="I6043">
          <instance name="OCD">
            <register-group address-space="data" offset="0x002E" name-in-module="OCD" name="OCD"/>
          </instance>
        </module>
        <module name="CPU" id="I6000">
          <instance name="CPU">
            <register-group address-space="data" offset="0x0030" name-in-module="CPU" name="CPU"/>
          </instance>
        </module>
        <module name="CLK" id="I6073" version="XMEGAD">
          <instance name="CLK">
            <register-group address-space="data" offset="0x0040" name-in-module="CLK" name="CLK"/>
          </instance>
        </module>
        <module name="PR" id="I6073" version="XMEGAD">
          <instance name="PR">
            <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
          </instance>
        </module>
        <module name="SLEEP" id="I6081">
          <instance name="SLEEP">
            <register-group address-space="data" offset="0x0048" name-in-module="SLEEP" name="SLEEP"/>
          </instance>
        </module>
        <module name="OSC" id="I6079" version="XMEGAD">
          <instance name="OSC">
            <register-group address-space="data" offset="0x0050" name-in-module="OSC" name="OSC"/>
            <signals>
              <signal function="XTAL" group="XTAL2" pad="PR0"/>
              <signal function="XTAL" group="XTAL1" pad="PR1"/>
              <signal function="TOSC" group="TOSC2" pad="PR0"/>
              <signal function="TOSC" group="TOSC1" pad="PR1"/>
              <signal function="TOSC_ALT" group="TOSC2" pad="PE2"/>
              <signal function="TOSC_ALT" group="TOSC1" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="DFLL" id="I6055" version="XMEGAAU">
          <instance name="DFLLRC32M">
            <register-group address-space="data" offset="0x0060" name-in-module="DFLL" name="DFLLRC32M"/>
