avr-rust/avrd/packs/xmegad/ATxmega64D4.atdf
        <register caption="Device ID byte 2" name="DEVID2" offset="0x02" size="1"/>
        <register caption="Revision ID" name="REVID" offset="0x03" size="1"/>
        <register caption="Analog Startup Delay" name="ANAINIT" offset="0x07" size="1">
          <bitfield caption="Analog startup delay Port A" mask="0x03" name="STARTUPDLYA"/>
        </register>
        <register caption="Event System Lock" name="EVSYSLOCK" offset="0x08" size="1">
          <bitfield caption="Event Channel 0-3 Lock" mask="0x01" name="EVSYS0LOCK"/>
        </register>
        <register caption="AWEX Lock" name="AWEXLOCK" offset="0x09" size="1">
          <bitfield caption="AWeX on T/C C0 Lock" mask="0x01" name="AWEXCLOCK"/>
        </register>
      </register-group>
    </module>
    <module
      xmlns:xi="http://www.w3.org/2001/XInclude" name="PMIC" caption="Programmable Multi-level Interrupt Controller" id="I6057">
      <register-group name="PMIC" caption="Programmable Multi-level Interrupt Controller" size="16">
        <register name="STATUS" caption="Status Register" size="1" offset="0x00">
          <bitfield name="NMIEX" caption="Non-maskable Interrupt Executing" mask="0x80"/>
          <bitfield name="HILVLEX" caption="High Level Interrupt Executing" mask="0x04"/>
          <bitfield name="MEDLVLEX" caption="Medium Level Interrupt Executing" mask="0x02"/>
          <bitfield name="LOLVLEX" caption="Low Level Interrupt Executing" mask="0x01"/>
        </register>
        <register name="INTPRI" caption="Interrupt Priority" size="1" offset="0x01">
          <bitfield name="INTPRI" caption="Interrupt Priority" mask="0xFF"/>
        </register>
        <register name="CTRL" caption="Control Register" size="1" offset="0x02">
          <bitfield name="RREN" caption="Round-Robin Priority Enable" mask="0x80"/>
          <bitfield name="IVSEL" caption="Interrupt Vector Select" mask="0x40"/>
          <bitfield name="HILVLEN" caption="High Level Enable" mask="0x04"/>
          <bitfield name="MEDLVLEN" caption="Medium Level Enable" mask="0x02"/>
          <bitfield name="LOLVLEN" caption="Low Level Enable" mask="0x01"/>
        </register>
      </register-group>
    </module>
    <module name="PORTCFG" id="I6075" version="XMEGAD" caption="Port Configuration">
      <register-group caption="I/O port Configuration" name="PORTCFG" size="7">
        <register caption="Multi-pin Configuration Mask" name="MPCMASK" offset="0x00" size="1"/>
        <register caption="Virtual Port Control Register A" name="VPCTRLA" offset="0x02" size="1">
          <bitfield caption="Virtual Port 1 Mapping" mask="0xF0" name="VP1MAP" values="PORTCFG_VP13MAP"/>
          <bitfield caption="Virtual Port 0 Mapping" mask="0x0F" name="VP0MAP" values="PORTCFG_VP02MAP"/>
        </register>
        <register caption="Virtual Port Control Register B" name="VPCTRLB" offset="0x03" size="1">
          <bitfield caption="Virtual Port 3 Mapping" mask="0xF0" name="VP3MAP" values="PORTCFG_VP13MAP"/>
          <bitfield caption="Virtual Port 2 Mapping" mask="0x0F" name="VP2MAP" values="PORTCFG_VP02MAP"/>
        </register>
        <register caption="Clock and Event Out Register" name="CLKEVOUT" offset="0x04" size="1">
          <bitfield caption="Peripheral Clock Output Port" mask="0x03" name="CLKOUT" values="PORTCFG_CLKOUT"/>
          <bitfield caption="Peripheral Clock Output Select" mask="0x0C" name="CLKOUTSEL" values="PORTCFG_CLKOUTSEL"/>
          <bitfield caption="Event Output Port" mask="0x30" name="EVOUT" values="PORTCFG_EVOUT"/>
          <bitfield caption="RTC Clock Output" mask="0x40" name="RTCOUT"/>
          <bitfield caption="Peripheral Clock and Event Output pin Select" mask="0x80" name="CLKEVPIN"/>
        </register>
        <register caption="Event Output Select" name="EVOUTSEL" offset="0x06" size="1">
          <bitfield caption="Event Output Select" mask="0x07" name="EVOUTSEL" values="PORTCFG_EVOUTSEL"/>
        </register>
      </register-group>
      <value-group caption="Virtual Port Mapping" name="PORTCFG_VP02MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="Virtual Port Mapping" name="PORTCFG_VP13MAP">
        <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
        <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
        <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
        <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
        <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
        <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
        <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
        <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
        <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
        <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
        <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
        <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
        <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
        <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
        <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
        <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
      </value-group>
      <value-group caption="System Clock Output Port" name="PORTCFG_CLKOUT">
        <value caption="System Clock Output Disabled" name="OFF" value="0x00"/>
        <value caption="System Clock Output on Port C pin 7" name="PC7" value="0x01"/>
        <value caption="System Clock Output on Port D pin 7" name="PD7" value="0x02"/>
        <value caption="System Clock Output on Port E pin 7" name="PE7" value="0x03"/>
      </value-group>
      <value-group caption="Peripheral Clock Output Select" name="PORTCFG_CLKOUTSEL">
        <value caption="1x Peripheral Clock Output to pin" name="CLK1X" value="0x00"/>
        <value caption="2x Peripheral Clock Output to pin" name="CLK2X" value="0x01"/>
        <value caption="4x Peripheral Clock Output to pin" name="CLK4X" value="0x02"/>
      </value-group>
